In [2]:
import pandas as pd
from pyhive.hive import Connection

In [10]:
host = '10.10.10.225' # NDAP IP 주소
port = 10000 # port 고정
username = 'admin' # NDAP NDAP 아이디P
password = 'admin' # MDAP NDAP 비밀번호
#schema = 'cvr_adpk_5221_sample' # 접근할 NDAP NDAP 스키마명

conn = Connection(host = host, port = port, username = username, password = password, auth = 'LDAP')

In [8]:
conn.close()

In [ ]:
# 고등학생 후보군
query1 = """
select * from jaeyoung.high_std_candidate
"""
df_high = pd.read_sql(query1, conn)
df_high.to_csv("/home/jaeyoung/projects/job_seg/src/data/dmp/high_adid.csv", index=False)

In [16]:
# 대학생 후보군
query2 = """
select * from jaeyoung.univ_std_candidate
"""
df_univ = pd.read_sql(query2, conn)
df_univ.to_csv("/home/jaeyoung/projects/job_seg/src/data/dmp/univ_adid.csv", index=False)

/tmp/ipykernel_1241660/2077484013.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_univ = pd.read_sql(query2, conn)

In [ ]:
# 근로자 후보군
query3 = """
select * from jaeyoung.worker_candidate
"""
df_work = pd.read_sql(query3, conn)
df_work.to_csv("/home/jaeyoung/projects/job_seg/src/data/dmp/work_adid.csv", index=False)

/tmp/ipykernel_1241660/2943042864.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_work = pd.read_sql(query3, conn)

In [ ]:
# age_true

query3 = """
select * from jaeyoung.age_true
"""
df_work = pd.read_sql(query3, conn)
df_work.to_csv("/home/jaeyoung/projects/job_seg/src/data/dmp/age_true.csv", index=False)

In [11]:
# 대학생 앱 설치 내역

query3 = """
select * from jaeyoung.univ_app
"""
df_work = pd.read_sql(query3, conn)
df_work.to_csv("/home/jaeyoung/projects/job_seg/src/data/dmp/univ_app.csv", index=False)

/tmp/ipykernel_2122575/159472185.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_work = pd.read_sql(query3, conn)

In [74]:
match = pd.read_csv(
    "/home/jaeyoung/projects/job_seg/output/company_matched.csv"
)

ctp_nm = pd.read_csv(
    "/home/jaeyoung/projects/job_seg/src/data/final/기업위치_20251215.csv",
    on_bad_lines="skip",      
    engine="python"           
)[['ctp_cd', 'ctp_nm']]

match['ctp_cd'] = match['ctp_cd'].astype(str)
ctp_nm['ctp_cd'] = ctp_nm['ctp_cd'].astype(str)

ctp_nm = ctp_nm[['ctp_cd', 'ctp_nm']].drop_duplicates().reset_index(drop=True)


result = (
    match
    .groupby('ctp_cd', dropna=False)
    .size()
    .reset_index(name='row_cnt')
)
result = result.merge(ctp_nm, on='ctp_cd', how='inner')
result

          ctp_cd  row_cnt   ctp_nm
0   1100000000.0     7056    서울특별시
1   2600000000.0        2    부산광역시
2   2700000000.0        3    대구광역시
3   2800000000.0       81    인천광역시
4   3000000000.0        2    대전광역시
5   4100000000.0      391      경기도
6   4400000000.0       10     충청남도
7   4600000000.0        1     전라남도
8   4700000000.0        5     경상북도
9   4800000000.0       56     경상남도
10  5000000000.0       36  제주특별자치도

In [77]:
match['corp_cd'].value_counts()

corp_cd
167208     1263
978075     1000
144155      990
309983      838
1605282     715
           ...
816544        1
352064        1
159218        1
1185566       1
151447        1
Name: count, Length: 81, dtype: int64

In [73]:
ctp_nm = pd.read_csv(
    "/home/jaeyoung/projects/job_seg/src/data/final/기업위치_20251215.csv"
)

ParserError: Error tokenizing data. C error: Expected 21 fields in line 350, saw 39

In [82]:
df = pd.read_csv(
    "/home/jaeyoung/projects/job_seg/output/high_school_matched.csv"
)

In [66]:
df= match[match['ctp_cd'] == 4100000000]
df['distance'].mean()

np.float64(65.93706467869697)

In [83]:
df.groupby(['lat', 'lon']).count().sort_values(by='adid', ascending =False)

                       adid  distance  fac_cd  ctp_cd  sig_cd  emd_cd
lat       lon
37.498700 126.782800  24758     24758   24758   24758   24758   24758
37.498800 126.782400  12556     12556   12556   12556   12556   12556
37.498700 126.782500  10606     10606   10606   10606   10606   10606
37.498800 126.782700   1636      1636    1636    1636    1636    1636
36.998200 127.090000   1215      1215    1215    1215    1215    1215
...                     ...       ...     ...     ...     ...     ...
37.747750 127.037710      1         1       1       1       1       1
37.700001 126.900002      1         1       1       1       1       1
37.862500 126.776730      1         1       1       1       1       1
37.880000 128.830000      1         1       1       1       1       1
37.891890 127.057724      1         1       1       1       1       1

[146 rows x 6 columns]

In [52]:
match['adid']

0         095e91c9-9d6d-4534-b9d6-7d06e32f47fa
1         0966bbbd-4443-46c5-8f96-fa62be49741b
2         099684f5-131f-4805-8e8d-d1dff8f61399
3         0996ba00-4ced-4701-87c4-317040159a3a
4         099db3d3-2fd6-433c-8a44-f184146f67d8
                          ...
214854    feba7d0f-0508-40b0-a4ef-6409712c06c8
214855    febaef7d-28c1-4cc9-88b2-bb3282b6c137
214856    fec4a458-19b5-4666-afbf-2351c1d45d0d
214857    fefeb7d6-5674-4252-a1a6-8104f4c4475a
214858    ffa73dbf-b54d-4100-8f92-fa2adde260f4
Name: adid, Length: 214859, dtype: object

In [ ]:
ctp_nm = pd.read_csv("/home/jaeyoung/projects/job_seg/src/data/final/고등학교_20251215.csv")
ctp_nm = ctp_nm[['ctp_cd', 'ctp_nm']]

,fac_cd,fac_nm,ctp_cd,ctp_nm,sig_cd,sig_nm,emd_cd,emd_nm,all_addr_nm,lat,lon
0,SH00009296,가곡고등학교,5100000000,강원특별자치도,5123000000,삼척시,5123035023,가곡면,강원특별자치도 삼척시 가곡면 오저리 88,37.145911,129.205185
1,SH00004100,건국고등학교,2600000000,부산광역시,2638000000,사하구,2638010300,하단동,부산광역시 사하구 하단동 산 41,35.109527,128.969616
2,SH00006665,건국대학교사범대학부속고등학교,1100000000,서울특별시,1121500000,광진구,1121510700,화양동,서울특별시 광진구 화양동 5-28,37.539183,127.074710
3,SH00004187,건양대학교병설건양고등학교,4400000000,충청남도,4423000000,논산시,4423039028,양촌면,충청남도 논산시 양촌면 남산리 564,36.141334,127.234614
4,SH00006563,검단고등학교,2800000000,인천광역시,2826000000,서구,2826011300,마전동,인천광역시 서구 마전동 249-16,37.603512,126.665010
...,...,...,...,...,...,...,...,...,...,...,...
2368,SH00000427,인천정보산업고등학교,2800000000,인천광역시,2811000000,중구,2811013000,유동,인천광역시 중구 율목동 12,37.470537,126.636579
2369,SH00205232,인천중산고등학교,2800000000,인천광역시,2811000000,중구,2811014500,중산동,인천 중구 중산동 1914-1,37.497721,126.569941
2370,SH00005450,인천중앙여자상업고등학교,2800000000,인천광역시,2811000000,중구,2811013200,도원동,인천광역시 중구 도원동 12-75,37.465416,126.641812
2371,SH00002546,인천진산과학고등학교,2800000000,인천광역시,2823700000,부평구,2823710500,삼산동,인천광역시 부평구 삼산동 456-6,37.513004,126.743263
2372,SH00204211,인천청담고등학교,2800000000,인천광역시,2818500000,연수구,2818510500,동춘동,인천광역시 연수구 동춘동 778-4,37.412515,126.660326

In [78]:
import pandas as pd

df = match
# 1. 알파벳 코드 -> 산업분류명 매핑 딕셔너리 정의
code_to_name = {
    "A": "농업, 임업 및 어업(01~03)",
    "B": "광업(05~08)",
    "C": "제조업(10~34)",
    "D": "전기, 가스, 증기 및 공기조절 공급업(35)",
    "E": "수도, 하수 및 폐기물 처리, 원료 재생업(36~39)",
    "F": "건설업(41~42)",
    "G": "도매 및 소매업(45~47)",
    "H": "운수 및 창고업(49~52)",
    "I": "숙박 및 음식점업(55~56)",
    "J": "정보통신업(58~63)",
    "K": "금융 및 보험업(64~66)",
    "L": "부동산업(68)",
    "M": "전문, 과학 및 기술 서비스업(70~73)",
    "N": "사업시설 관리, 사업 지원 및 임대 서비스업(74~76)",
    "O": "공공행정, 국방 및 사회보장 행정(84)",
    "P": "교육 서비스업(85)",
    "Q": "보건업 및 사회복지 서비스업(86~87)",
    "R": "예술, 스포츠 및 여가관련 서비스업(90~91)",
    "S": "협회 및 단체, 수리 및 기타 개인 서비스업(94~96)",
    "T": "가구 내 고용활동 및 기타 자가소비 생산활동(97~98)",
    "U": "국제 및 외국기관(99)",
    "Z": "기타/미분류"
}

# 2. 매핑 적용하여 새로운 컬럼(depth1_nm) 생성
# 만약 딕셔너리에 없는 코드가 있다면 NaN이 됩니다. 이를 막기 위해 .get()이나 fillna를 쓸 수도 있습니다.
df['depth1_nm'] = df['corp_depth1_cd'].map(code_to_name).fillna("기타/미분류")

# 3. 산업분류명(depth1_nm)별 adid 수 집계
# adid가 중복될 수 있으므로 nunique()를 사용하여 고유 유저 수를 셉니다.
# (단순 행 개수가 필요하면 count()를 사용하세요)
result = df.groupby('depth1_nm')['adid'].nunique().reset_index()

# 4. 결과 컬럼명 변경 (보기 좋게)
result.columns = ['산업분류명', '유저수(ADID)']

# 5. 유저 수 많은 순서대로 정렬
result = result.sort_values(by='유저수(ADID)', ascending=False)

# 결과 확인
result

                              산업분류명  유저수(ADID)
10                     정보통신업(58~63)       2487
2                   금융 및 보험업(64~66)       2060
8                   운수 및 창고업(49~52)       1085
11                       제조업(10~34)        953
3                   도매 및 소매업(45~47)        399
0                        건설업(41~42)         58
5   사업시설 관리, 사업 지원 및 임대 서비스업(74~76)         16
1                       교육 서비스업(85)         10
9           전문, 과학 및 기술 서비스업(70~73)          5
4                          부동산업(68)          2
7        예술, 스포츠 및 여가관련 서비스업(90~91)          2
6                  숙박 및 음식점업(55~56)          1

## 검증용

In [ ]:
query1 = """
select * from jaeyoung.SNR_202512_highstd_adid_list_f
"""
query2 = """
select * from jaeyoung.SNR_202512_univstd_adid_list_f
"""
query3 ="""
select * from jaeyoung.SNR_202512_worker_adid_list_f
"""

df_high = pd.read_sql(query1, conn)
df_univ = pd.read_sql(query2, conn)
df_work = pd.read_sql(query3, conn)

df_high.to_csv("/home/jaeyoung/projects/job_seg/src/data/dmp/high_verifi_adid.csv", index=False)
df_univ.to_csv("/home/jaeyoung/projects/job_seg/src/data/dmp/univ_verifi_adid.csv", index=False)
df_work.to_csv("/home/jaeyoung/projects/job_seg/src/data/dmp/worker_verifi_adid.csv", index=False)

/tmp/ipykernel_1498896/3783357828.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_high = pd.read_sql(query1, conn)
/tmp/ipykernel_1498896/3783357828.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_univ = pd.read_sql(query2, conn)
/tmp/ipykernel_1498896/3783357828.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_work = pd.read_sql(query3, conn)